Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
wireless_tracker.build.usb_mode=1
wireless_tracker.build.cdc_on_boot=0
wireless_tracker.build.msc_on_boot=0
wireless_tracker.build.dfu_on_boot=0
wireless_tracker.build.f_cpu=240000000L
wireless_tracker.build.flash_size=4MB
wireless_tracker.build.flash_freq=80m
wireless_tracker.build.flash_mode=dio
wireless_tracker.build.boot=qio
wireless_tracker.build.boot_freq=80m
wireless_tracker.build.partitions=default
wireless_tracker.build.loop_core=
wireless_tracker.build.event_core=
wireless_tracker.build.psram_type=qspi
wireless_tracker.build.memory_type={build.boot}_{build.psram_type}

wireless_tracker.menu.PSRAM.disabled=Disabled
wireless_tracker.menu.PSRAM.disabled.build.psram_val=
wireless_tracker.menu.PSRAM.disabled.build.psram_type=qspi
wireless_tracker.menu.PSRAM.enabled=QSPI PSRAM
wireless_tracker.menu.PSRAM.enabled.build.psram_val=-DBOARD_HAS_PSRAM
wireless_tracker.menu.PSRAM.enabled.build.psram_type=qspi
wireless_tracker.menu.PSRAM.opi=OPI PSRAM
wireless_tracker.menu.PSRAM.opi.build.psram_val=-DBOARD_HAS_PSRAM
wireless_tracker.menu.PSRAM.opi.build.psram_type=opi

wireless_tracker.menu.FlashMode.qio=QIO 80MHz
wireless_tracker.menu.FlashMode.qio.build.flash_mode=dio
wireless_tracker.menu.FlashMode.qio.build.boot=qio
wireless_tracker.menu.FlashMode.qio.build.boot_freq=80m
wireless_tracker.menu.FlashMode.qio.build.flash_freq=80m
wireless_tracker.menu.FlashMode.qio120=QIO 120MHz
wireless_tracker.menu.FlashMode.qio120.build.flash_mode=dio
wireless_tracker.menu.FlashMode.qio120.build.boot=qio
wireless_tracker.menu.FlashMode.qio120.build.boot_freq=120m
wireless_tracker.menu.FlashMode.qio120.build.flash_freq=80m
wireless_tracker.menu.FlashMode.dio=DIO 80MHz
wireless_tracker.menu.FlashMode.dio.build.flash_mode=dio
wireless_tracker.menu.FlashMode.dio.build.boot=dio
wireless_tracker.menu.FlashMode.dio.build.boot_freq=80m
wireless_tracker.menu.FlashMode.dio.build.flash_freq=80m
wireless_tracker.menu.FlashMode.opi=OPI 80MHz
wireless_tracker.menu.FlashMode.opi.build.flash_mode=dout
wireless_tracker.menu.FlashMode.opi.build.boot=opi
wireless_tracker.menu.FlashMode.opi.build.boot_freq=80m
wireless_tracker.menu.FlashMode.opi.build.flash_freq=80m

wireless_tracker.menu.FlashSize.4M=4MB (32Mb)
wireless_tracker.menu.FlashSize.4M.build.flash_size=4MB
wireless_tracker.menu.FlashSize.8M=8MB (64Mb)
wireless_tracker.menu.FlashSize.8M.build.flash_size=8MB
wireless_tracker.menu.FlashSize.8M.build.partitions=default_8MB
wireless_tracker.menu.FlashSize.16M=16MB (128Mb)
wireless_tracker.menu.FlashSize.16M.build.flash_size=16MB
#wireless_tracker.menu.FlashSize.32M=32MB (256Mb)
#wireless_tracker.menu.FlashSize.32M.build.flash_size=32MB

wireless_tracker.menu.LoopCore.1=Core 1
wireless_tracker.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
wireless_tracker.menu.LoopCore.0=Core 0
wireless_tracker.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

wireless_tracker.menu.EventsCore.1=Core 1
wireless_tracker.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
wireless_tracker.menu.EventsCore.0=Core 0
wireless_tracker.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

wireless_tracker.menu.USBMode.hwcdc=Hardware CDC and JTAG
wireless_tracker.menu.USBMode.hwcdc.build.usb_mode=1
wireless_tracker.menu.USBMode.default=USB-OTG (TinyUSB)
wireless_tracker.menu.USBMode.default.build.usb_mode=0

wireless_tracker.menu.CDCOnBoot.default=Disabled
wireless_tracker.menu.CDCOnBoot.default.build.cdc_on_boot=0
wireless_tracker.menu.CDCOnBoot.cdc=Enabled
wireless_tracker.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

wireless_tracker.menu.MSCOnBoot.default=Disabled
wireless_tracker.menu.MSCOnBoot.default.build.msc_on_boot=0
wireless_tracker.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
wireless_tracker.menu.MSCOnBoot.msc.build.msc_on_boot=1

wireless_tracker.menu.DFUOnBoot.default=Disabled
wireless_tracker.menu.DFUOnBoot.default.build.dfu_on_boot=0
wireless_tracker.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
wireless_tracker.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

wireless_tracker.menu.UploadMode.default=UART0 / Hardware CDC
wireless_tracker.menu.UploadMode.default.upload.use_1200bps_touch=false
wireless_tracker.menu.UploadMode.default.upload.wait_for_upload_port=false
wireless_tracker.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
wireless_tracker.menu.UploadMode.cdc.upload.use_1200bps_touch=true
wireless_tracker.menu.UploadMode.cdc.upload.wait_for_upload_port=true

wireless_tracker.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
wireless_tracker.menu.PartitionScheme.default.build.partitions=default
wireless_tracker.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
wireless_tracker.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
wireless_tracker.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
wireless_tracker.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
wireless_tracker.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
wireless_tracker.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
wireless_tracker.menu.PartitionScheme.minimal.build.partitions=minimal
wireless_tracker.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
wireless_tracker.menu.PartitionScheme.no_ota.build.partitions=no_ota
wireless_tracker.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wireless_tracker.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
wireless_tracker.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
wireless_tracker.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
wireless_tracker.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
wireless_tracker.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
wireless_tracker.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
wireless_tracker.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
wireless_tracker.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
wireless_tracker.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
wireless_tracker.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
wireless_tracker.menu.PartitionScheme.huge_app.build.partitions=huge_app
wireless_tracker.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
wireless_tracker.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
wireless_tracker.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wireless_tracker.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
wireless_tracker.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
wireless_tracker.menu.PartitionScheme.fatflash.build.partitions=ffat
wireless_tracker.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
wireless_tracker.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
wireless_tracker.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
wireless_tracker.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
wireless_tracker.menu.PartitionScheme.rainmaker=RainMaker
wireless_tracker.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
wireless_tracker.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

wireless_tracker.menu.CPUFreq.240=240MHz (WiFi)
wireless_tracker.menu.CPUFreq.240.build.f_cpu=240000000L
wireless_tracker.menu.CPUFreq.160=160MHz (WiFi)
wireless_tracker.menu.CPUFreq.160.build.f_cpu=160000000L
wireless_tracker.menu.CPUFreq.80=80MHz (WiFi)
wireless_tracker.menu.CPUFreq.80.build.f_cpu=80000000L
wireless_tracker.menu.CPUFreq.40=40MHz
wireless_tracker.menu.CPUFreq.40.build.f_cpu=40000000L
wireless_tracker.menu.CPUFreq.20=20MHz
wireless_tracker.menu.CPUFreq.20.build.f_cpu=20000000L
wireless_tracker.menu.CPUFreq.10=10MHz
wireless_tracker.menu.CPUFreq.10.build.f_cpu=10000000L

wireless_tracker.menu.UploadSpeed.921600=921600
wireless_tracker.menu.UploadSpeed.921600.upload.speed=921600
wireless_tracker.menu.UploadSpeed.115200=115200
wireless_tracker.menu.UploadSpeed.115200.upload.speed=115200
wireless_tracker.menu.UploadSpeed.256000.windows=256000
wireless_tracker.menu.UploadSpeed.256000.upload.speed=256000
wireless_tracker.menu.UploadSpeed.230400.windows.upload.speed=256000
wireless_tracker.menu.UploadSpeed.230400=230400
wireless_tracker.menu.UploadSpeed.230400.upload.speed=230400
wireless_tracker.menu.UploadSpeed.460800.linux=460800
wireless_tracker.menu.UploadSpeed.460800.macosx=460800
wireless_tracker.menu.UploadSpeed.460800.upload.speed=460800
wireless_tracker.menu.UploadSpeed.512000.windows=512000
wireless_tracker.menu.UploadSpeed.512000.upload.speed=512000

wireless_tracker.menu.DebugLevel.none=None
wireless_tracker.menu.DebugLevel.none.build.code_debug=0
wireless_tracker.menu.DebugLevel.error=Error
wireless_tracker.menu.DebugLevel.error.build.code_debug=1
wireless_tracker.menu.DebugLevel.warn=Warn
wireless_tracker.menu.DebugLevel.warn.build.code_debug=2
wireless_tracker.menu.DebugLevel.info=Info
wireless_tracker.menu.DebugLevel.info.build.code_debug=3
wireless_tracker.menu.DebugLevel.debug=Debug
wireless_tracker.menu.DebugLevel.debug.build.code_debug=4
wireless_tracker.menu.DebugLevel.verbose=Verbose
wireless_tracker.menu.DebugLevel.verbose.build.code_debug=5

wireless_tracker.menu.LORAWAN_REGION.0=REGION_EU868
wireless_tracker.menu.LORAWAN_REGION.0.build.band=REGION_EU868
wireless_tracker.menu.LORAWAN_REGION.1=REGION_EU433
wireless_tracker.menu.LORAWAN_REGION.1.build.band=REGION_EU433
wireless_tracker.menu.LORAWAN_REGION.2=REGION_CN470
wireless_tracker.menu.LORAWAN_REGION.2.build.band=REGION_CN470
wireless_tracker.menu.LORAWAN_REGION.3=REGION_US915
wireless_tracker.menu.LORAWAN_REGION.3.build.band=REGION_US915
wireless_tracker.menu.LORAWAN_REGION.4=REGION_AU915
wireless_tracker.menu.LORAWAN_REGION.4.build.band=REGION_AU915
wireless_tracker.menu.LORAWAN_REGION.5=REGION_CN779
wireless_tracker.menu.LORAWAN_REGION.5.build.band=REGION_CN779
wireless_tracker.menu.LORAWAN_REGION.6=REGION_AS923
wireless_tracker.menu.LORAWAN_REGION.6.build.band=REGION_AS923
wireless_tracker.menu.LORAWAN_REGION.7=REGION_KR920
wireless_tracker.menu.LORAWAN_REGION.7.build.band=REGION_KR920
wireless_tracker.menu.LORAWAN_REGION.8=REGION_IN865
wireless_tracker.menu.LORAWAN_REGION.8.build.band=REGION_IN865
wireless_tracker.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
wireless_tracker.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

